tests/Mock/PurchaseSuccess.txt

HTTP/1.1 200 OK
Content-Type: application/json
Transfer-Encoding: chunked
Accept-Ranges: bytes
Connection: keep-alive
Vary: Authorization

{
  "checkout_id": 670902310,
  "account_id": 783276130,
  "type": "goods",
  "short_description": "A vacation home rental\nA vacation home rental2",
  "currency": "USD",
  "amount": 25.5,
  "state": "new",
  "soft_descriptor": "WPY*Agbonghama Collins",
  "auto_capture": true,
  "create_time": 1443531874,
  "long_description": "A vacation home rental",
  "reference_id": "12345",
  "callback_uri": null,
  "delivery_type": null,
  "fee": {
    "app_fee": 0,
    "fee_payer": "payee",
    "processing_fee": 0
  },
  "gross": 0,
  "chargeback": {
    "amount_charged_back": 0,
    "dispute_uri": null
  },
  "refund": {
    "amount_refunded": 0,
    "refund_reason": null
  },
  "hosted_checkout": {
    "checkout_uri": "https:\/\/stage.wepay.com\/api\/checkout\/670902310\/88a87911",
    "redirect_uri": "http:\/\/localhost.dev\/wp-content\/plugins\/omnipaywp\/complete.php",
    "shipping_fee": 0,
    "require_shipping": false,
    "shipping_address": null,
    "theme_object": null,
    "mode": "regular"
  },
  "payment_method": null,
  "payer": {
    "name": null,
    "email": null,
    "home_address": null
  }
}